D=0.05/turbulent/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 22.4;

boundaryField
{
    fixedwall
    {
        type            omegaWallFunction;
        value           uniform 22.4;
    }
    empty
    {
        type            empty;
    }
    top
    {
        type            fixedValue;
        value           uniform 22.4;    
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
